NEEMSYS/HATBED_CAN_ESP8266_Test/CAN_RX_PWM_Control/Src/main.c
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_LOW;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  HAL_TIM_MspPostInit(&htim3);

}

/* USART1 init function */
static void MX_USART1_UART_Init(void)
{

  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* USART2 init function */
static void MX_USART2_UART_Init(void)
{

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, LED1_Pin|LED2_Pin|LED3_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(C_GPIO_GPIO_Port, C_GPIO_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : LED1_Pin LED2_Pin LED3_Pin */
  GPIO_InitStruct.Pin = LED1_Pin|LED2_Pin|LED3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : C_GPIO_Pin */
  GPIO_InitStruct.Pin = C_GPIO_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(C_GPIO_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/*
void Setup_Icing(int Icing_value)
{
  setupCounter = 0xAA;
  uint16_t dutyCycle = 0;
  // HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
  if (Icing_value > 5)
  {
    dutyCycle = 0;
    while (dutyCycle < 1000)    // 逐渐降低动力输出，使低电平比例到950/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }

    while (dutyCycle > 200)    // 逐渐升高动力输出，使低电平比例到150/1000
    {
      dutyCycle -= 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }

  if (Icing_value <= 5 && Icing_value > 2)
  {
    dutyCycle = 0;
    while (dutyCycle < 700)    // 逐渐降低动力输出，使低电平比例到650/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }

    while (dutyCycle > 200)    // 逐渐升高动力输出，使低电平比例到150/1000
    {
      dutyCycle -= 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }
}

void Setup_Visibility(int visibility_value)
{
  setupCounter = 0xAB;
  HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
    
  uint16_t dutyCycle = 0;
  // HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
  if (visibility_value < 5)    // 能见度小于5公里
  {
    dutyCycle = 0;
    while (dutyCycle < 600)    // 逐渐降低动力输出，使低电平比例到550/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }

    while (dutyCycle > 400)    // 逐渐升高动力输出，使低电平比例到350/1000
    {
      dutyCycle -= 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }

  if (visibility_value < 7)    // 能见度小于7公里
  {
    dutyCycle = 0;
    while (dutyCycle < 700)    // 逐渐降低动力输出，使低电平比例到650/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }
}

void Setup_Rainfall(int Rainfall_value)
{
  setupCounter = 0xAC;
  uint16_t dutyCycle = 0;
  // HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
  if (Rainfall_value > 200)     // 降雨量大于200
  {
    dutyCycle = 0;
    while (dutyCycle < 900)    // 逐渐降低动力输出，使低电平比例到850/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }

    while (dutyCycle > 200)    // 逐渐升高动力输出，使低电平比例到150/1000
    {
      dutyCycle -= 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }

  if (Rainfall_value <= 200 && Rainfall_value > 100)    // 降雨量在100-200间
  {
    dutyCycle = 0;
    while (dutyCycle < 700)    // 逐渐降低动力输出，使低电平比例到650/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }

    while (dutyCycle > 200)    // 逐渐升高动力输出，使低电平比例到150/1000
    {
      dutyCycle -= 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }
}

void Setup_Light(int Light_value)
{
  setupCounter = 0xAD;
  if (Light_value < 200)
  {
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
  }
  if (Light_value < 300 && Light_value >= 200)
  {
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
  }
  if (Light_value < 400 && Light_value >= 300)
  {
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
  }
  if (Light_value >= 400)
  {
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
  }
}

void Setup_Flow_Speed(int Flow_value, int speed_value)
{
  setupCounter = 0xAE;
  uint16_t dutyCycle = 0;
  // HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
  if (Flow_value > 30 && speed_value < 30)     // 车流量大于30，车流速度小于30
  {
    dutyCycle = 0;
    while (dutyCycle < 600)    // 逐渐降低动力输出，使低电平比例到550/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }

  if (Flow_value > 45 && speed_value < 20)    // 车流量大于45，车流速度小于20
  {
    dutyCycle = 0;
    while (dutyCycle < 800)    // 逐渐降低动力输出，使低电平比例到750/1000
    {
      dutyCycle += 50;
      __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
      osDelay(5);
    }
  }
}
*/

void PWM_100(void)
{
  globalCounter = 0xDA;
  uint16_t dutyCycle = 0;
  dutyCycle = 999;
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
  // printf("\r\nPWM_100");
  osDelay(250);
}

void PWM_70(void)
{
 globalCounter = 0xDB;
  uint16_t dutyCycle = 0;
  dutyCycle = 699;
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
  printf("\r\nPWM_70");
  osDelay(250);
}

