NEEMSYS/HATBED_CAN_ESP8266_Test/CAN_RX_PWM_Control/Src/main.c
void PWM_40(void)
{
  globalCounter = 0xDC;
  uint16_t dutyCycle = 0;
  dutyCycle = 399;
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
  printf("\r\nPWM_40");
  osDelay(250);
}

void PWM_10(void)
{
  globalCounter = 0xDD;
  uint16_t dutyCycle = 0;
  dutyCycle = 99;
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, dutyCycle);
  printf("\r\nPWM_10");
  osDelay(250);
}

/* USER CODE END 4 */

/* Func_Task0 function */
void Func_Task0(void const * argument)
{

  /* USER CODE BEGIN 5 */
    // hcan.pTxMsg = &TxMessage;    // hc.pTxMsg 按 TxMessage格式
    hcan.pRxMsg = &RxMessage;

    HAL_UART_Transmit(&huart2,"\r\nFunc_Task0\r\n",14,10);

    sFliterConfig.FilterNumber         = 0;
    sFliterConfig.FilterMode           = CAN_FILTERMODE_IDMASK;
    sFliterConfig.FilterScale          = CAN_FILTERSCALE_32BIT;            // 查看了下.h文件，最大滤波器位宽就是32位，8个字符
    sFliterConfig.FilterIdHigh         = 0x0000;
    sFliterConfig.FilterIdLow          = 0x0000;
    sFliterConfig.FilterMaskIdHigh     = 0x0000;
    sFliterConfig.FilterMaskIdLow      = 0x0000;
    sFliterConfig.FilterFIFOAssignment = CAN_FILTER_FIFO0;
    sFliterConfig.FilterActivation     = ENABLE;
    // sFliterConfig.BankNumber           = 14;

    HAL_CAN_ConfigFilter(&hcan, &sFliterConfig);

    HAL_CAN_Receive_IT(&hcan, CAN_FIFO0);

    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 999);

    // hcan.pTxMsg -> ExtId = 0x1314;
    // hcan.pTxMsg -> RTR = CAN_RTR_DATA;
    // hcan.pTxMsg -> IDE = CAN_ID_EXT;
    // hcan.pTxMsg -> DLC = 2;
    // hcan.pTxMsg -> Data[0] = 0xAB;
    // hcan.pTxMsg -> Data[1] = 0xCD;

    // HAL_CAN_Transmit(&hcan, 10);  // 注意第二个参数是timeout，与常规库函数不同
    /* Infinite loop */
    for(;;)
    {
        // osDelay(1000);
        // HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);
        // HAL_CAN_Transmit(&hcan, 10);

        osDelay(1);
        /*
        if (flag == 0)
        {
          __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 999);    // 在没有传感器数据到来时保证动力充足
        }
        */
 
        if (a == 0 && s == 0)
        {
          PWM_100();
        }
        else if (a == 0 && s == 1)
        {
          PWM_10();
        }
        else if (a == 1 && s == 1)
        {
          PWM_40();
        }
        else if (a == 1 && s == 0)
        {
          PWM_70();    
        }

        // HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
        // HAL_CAN_Transmit(&hcan, 10);
    }
  /* USER CODE END 5 */ 
}

/* Func_Task1 function */
void Func_Task1(void const * argument)
{
  /* USER CODE BEGIN Func_Task1 */
    /* Infinite loop */
    flag = 0;

    char str1[8];
    char str2[8];

    char user_str[24];
    char uart_str[8];
    
    int temperature, humidity, Light, visibility, Rainfall, Flow, speed,Icing;

    HAL_UART_Transmit(&huart2,"CAN_RX", 6, 10);

    for(;;)
    {
      // osDelay(1);
      if (flag == 1)
	  {
		globalCounter = 0x0C;    // 报告0x0C意味CAN口接收到了1个P的数据
		flag = 0;
		HAL_UART_Transmit(&huart2, "\r\nOK\r\n", 6, 10);
		
		if ((RxMessage.Data[0] == 9 && RxMessage.Data[1] == 8) || (RxMessage.Data[0] == 1 && RxMessage.Data[1] == 2))
		{
		  sprintf(str1, "%d", RxMessage.Data[0]);
		  sprintf(str2, "%d", RxMessage.Data[1]);
		  // if (RxMessage.Data[0] = 0xAB)
		  //     HAL_UART_Transmit(&huart1, "AB", 2, 10);
		  HAL_UART_Transmit(&huart2, str1, 8, 10);
		  HAL_UART_Transmit(&huart2, str2, 8, 10);
		}
		else
		{
		  HAL_UART_Transmit(&huart2,"\r\nRX SensorOK\r\n", 15, 10);
		  for (int p = 0;p < 8;p++)
		  {
		    sprintf(str1, "%c", RxMessage.Data[p]);
		    HAL_UART_Transmit(&huart2, str1, 8, 10);
		  }

		  if (RxMessage.Data[2] == 'T')        // 18T30H05P
		  {
		    HAL_UART_Transmit(&huart2,"\r\n1P\r\n", 6, 10);
		    for (int k = 0;k < 8;k++)
		    {
		      user_str[k] = RxMessage.Data[k];
		    }
		    sensor_flag1 = 8;
		  }

		  if (RxMessage.Data[2] == 'L' && sensor_flag1 == 8)        // 00L15V00P
		  {
		    HAL_UART_Transmit(&huart2,"\r\n2P\r\n", 6, 10);
		    for (int k = 0;k < 8;k++)
		    {
		      user_str[k + 8] = RxMessage.Data[k];
		    }
		    sensor_flag2 = 16;
		  }

		  if (RxMessage.Data[1] == 'R' && sensor_flag2 == 16)        // 0R30F45SP
		  {
		    HAL_UART_Transmit(&huart2,"\r\n3P\r\n", 6, 10);
		    for (int k = 0;k < 8;k++)
		    {
		      user_str[k + 8 + 8] = RxMessage.Data[k];
		    }
		    sensor_flag3 = 24;

            temperature = (user_str[0] - 0x30) * 10 + (user_str[1] - 0x30);
            printf("\r\ntemperature:%d",temperature);
  		    

	    	if (user_str[5] == 'H')
            {
              humidity = (user_str[3] - 0x30) * 10 + (user_str[4] - 0x30);
              printf("\r\nhumidity:",humidity);
            }
            if (user_str[5] == 'I')
            {  
              Icing = (user_str[3] - 0x30) * 10 + (user_str[4] - 0x30);
              // Setup_Icing(Icing);
              printf("\r\nIcing:%d",Icing);
            }


	    	Light = (user_str[6] - 0x30) * 1000 + (user_str[7] - 0x30) * 100 + (user_str[8] - 0x30) * 10 + + (user_str[9] - 0x30);
		    // Setup_Light(Light);
            printf("\r\nLight:%d",Light);


	    	visibility = (user_str[11] - 0x30) * 10 + (user_str[12] - 0x30);
            // if (visibility < 10)
            // {  
              // HAL_UART_Transmit(&huart2,"\r\nFAT",5,10);    // 在计算没有错误的情况下，HAL_UART_Transmit出现显示错误,修改_write重定向printf则无措，不用管，反正那么多串口发送都得关闭
            //   printf("\r\nFAT");
            // }
		    // Setup_Visibility(visibility);

            printf("\r\nvisibility:%d",visibility);


		    Rainfall = (user_str[14] - 0x30) * 100 + (user_str[15] - 0x30) * 10 + + (user_str[16] - 0x30);
		    // Setup_Rainfall(Rainfall);    // 降雨量只调PWM
            printf("\r\nRainfall:%d",Rainfall);
	    	

	    	Flow = (user_str[18] - 0x30) * 10 + (user_str[19] - 0x30);
            printf("\r\nFlow:%d",Flow);
	    	

	    	speed = (user_str[21] - 0x30) * 10 + (user_str[22] - 0x30);
            printf("\r\nspeed:%d",speed);
		    // Setup_Flow_Speed(Flow, speed);
		  }

